---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType
source: html/e8d6a74d-1b0e-5b79-a57b-5dab3e4d2d36.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType

The type of electrical analytical node.

## Syntax (C#)
```csharp
public enum ElectricalAnalyticalNodeType
```